; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_2 ?v7 - type_2 ?v8 - type_3)
 	      (pred_3 ?v1 - object ?v8 - type_3)
	      (pred_4 ?v7 - type_2 ?v5 - type_1)
	      (pred_1 ?v7 - type_2 ?v1 - object ?v5 - type_1))

   (:action op_3
       :parameters  (?v7 - type_2 ?v4 ?v2 - type_3)
       :precondition (and  (pred_2 ?v7 ?v4))
       :effect (and  (pred_2 ?v7 ?v2)
		     (not (pred_2 ?v7 ?v4))))

   (:action op_2
       :parameters (?v7 - type_2 ?v6 - object ?v3 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_3 ?v6 ?v3) (pred_2 ?v7 ?v3) (pred_4 ?v7 ?v5))
       :effect (and (pred_1 ?v7 ?v6 ?v5)
		    (not (pred_3 ?v6 ?v3)) 
		    (not (pred_4 ?v7 ?v5))))

   (:action op_1
       :parameters (?v7 - type_2 ?v6 - object ?v3 - type_3 ?v5 - type_1)
       :precondition  (and  (pred_1 ?v7 ?v6 ?v5) (pred_2 ?v7 ?v3))
       :effect (and (pred_3 ?v6 ?v3)
		    (pred_4 ?v7 ?v5)
		    (not (pred_1 ?v7 ?v6 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_07 obj_11 - type_2
obj_04 obj_14 obj_10 obj_01 - type_1
obj_03 obj_12 obj_02 obj_05 - type_3
obj_09 obj_06 obj_13 obj_08 - object)
(:init
(pred_2 obj_07 obj_05)
(pred_4 obj_07 obj_04)
(pred_4 obj_07 obj_14)
(pred_2 obj_11 obj_02)
(pred_4 obj_11 obj_10)
(pred_4 obj_11 obj_01)
(pred_3 obj_09 obj_12)
(pred_3 obj_06 obj_12)
(pred_3 obj_13 obj_02)
(pred_3 obj_08 obj_03)
)
(:goal
(and
(pred_3 obj_09 obj_05)
(pred_3 obj_06 obj_02)
(pred_3 obj_13 obj_03)
(pred_3 obj_08 obj_12)
)
)

(:constraints
  (always (not (pred_2 obj_07 obj_02)))
)
)

; plan
1. (op_3 obj_07 obj_05 obj_03)
   deleted: (pred_2 obj_07 obj_05)
   added: (pred_2 obj_07 obj_03)
   goals met: 0 of 4
2. (op_2 obj_11 obj_13 obj_02 obj_01)
   deleted: (pred_3 obj_13 obj_02) (pred_4 obj_11 obj_01)
   added: (pred_1 obj_11 obj_13 obj_01)
   goals met: 0 of 4
3. (op_3 obj_11 obj_02 obj_03)
   deleted: (pred_2 obj_11 obj_02)
   added: (pred_2 obj_11 obj_03)
   goals met: 0 of 4
4. (op_2 obj_07 obj_08 obj_03 obj_14)
   deleted: (pred_3 obj_08 obj_03) (pred_4 obj_07 obj_14)
   added: (pred_1 obj_07 obj_08 obj_14)
   goals met: 0 of 4
5. (op_3 obj_07 obj_03 obj_12)
   deleted: (pred_2 obj_07 obj_03)
   added: (pred_2 obj_07 obj_12)
   goals met: 0 of 4
6. (op_1 obj_11 obj_13 obj_03 obj_01)
   deleted: (pred_1 obj_11 obj_13 obj_01)
   added: (pred_3 obj_13 obj_03) (pred_4 obj_11 obj_01)
   goals met: 1 of 4
7. (op_1 obj_07 obj_08 obj_12 obj_14)
   deleted: (pred_1 obj_07 obj_08 obj_14)
   added: (pred_3 obj_08 obj_12) (pred_4 obj_07 obj_14)
   goals met: 2 of 4
8. (op_2 obj_07 obj_06 obj_12 obj_04)
   deleted: (pred_3 obj_06 obj_12) (pred_4 obj_07 obj_04)
   added: (pred_1 obj_07 obj_06 obj_04)
   goals met: 2 of 4
9. (op_2 obj_07 obj_09 obj_12 obj_14)
   deleted: (pred_3 obj_09 obj_12) (pred_4 obj_07 obj_14)
   added: (pred_1 obj_07 obj_09 obj_14)
   goals met: 2 of 4
10. (op_3 obj_07 obj_12 obj_05)
   deleted: (pred_2 obj_07 obj_12)
   added: (pred_2 obj_07 obj_05)
   goals met: 2 of 4
11. (op_1 obj_07 obj_09 obj_05 obj_14)
   deleted: (pred_1 obj_07 obj_09 obj_14)
   added: (pred_3 obj_09 obj_05) (pred_4 obj_07 obj_14)
   goals met: 3 of 4
12. (op_3 obj_07 obj_05 obj_03)
   deleted: (pred_2 obj_07 obj_05)
   added: (pred_2 obj_07 obj_03)
   goals met: 3 of 4
13. (op_1 obj_07 obj_06 obj_03 obj_04)
   deleted: (pred_1 obj_07 obj_06 obj_04)
   added: (pred_3 obj_06 obj_03) (pred_4 obj_07 obj_04)
   goals met: 3 of 4
14. (op_2 obj_11 obj_06 obj_03 obj_01)
   deleted: (pred_3 obj_06 obj_03) (pred_4 obj_11 obj_01)
   added: (pred_1 obj_11 obj_06 obj_01)
   goals met: 3 of 4
15. (op_3 obj_11 obj_03 obj_02)
   deleted: (pred_2 obj_11 obj_03)
   added: (pred_2 obj_11 obj_02)
   goals met: 3 of 4
16. (op_1 obj_11 obj_06 obj_02 obj_01)
   deleted: (pred_1 obj_11 obj_06 obj_01)
   added: (pred_3 obj_06 obj_02) (pred_4 obj_11 obj_01)
   goals met: 4 of 4
